# Taps
tap 'homebrew/bundle'

brew 'gh'
brew 'mas'
brew 'git'
brew 'golang'
brew 'git-delta'
brew 'neovim'
brew 'sqlite3'

# Tools
brew 'jq'
brew 'bat'
brew 'watch'
brew 'ffmpeg'
brew 'mkcert'
brew 'ripgrep'
brew 'ollama'

# Apps
cask 'alacritty'
cask 'google-chrome'
cask 'firefox'
cask '1password'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'bruno'
cask 'figma'
cask 'handbrake'
cask 'raycast'
cask 'rectangle'
cask 'discord'
cask 'docker'
cask 'karabiner-elements'
cask 'tableplus'
cask 'netnewswire'
cask 'obs'
cask 'stats'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Things', id: 904280696
mas 'Tailscale', id: 1475387142
mas 'WireGuard', id: 1451685025
